In [15]:
import pandas as pd
import numpy as np
import random
from faker import Faker

In [16]:
product = pd.read_excel("data/car_product.xlsx")
city = pd.read_csv("data/city.csv")

In [17]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   product_id  50 non-null     int64
 1   brand       50 non-null     object
 2   model       50 non-null     object
 3   body_type   50 non-null     object
 4   year        50 non-null     int64
 5   price       50 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.5+ KB

In [18]:
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   kota_id    15 non-null     int64
 1   nama_kota  15 non-null     object
 2   latitude   15 non-null     float64
 3   longitude  15 non-null     float64
dtypes: float64(2), int64(1), object(1)
memory usage: 608.0+ bytes

In [19]:
# Create a Faker instance
fake = Faker()

# Generate 20 random dealer names and IDs
dealer_data = []
for i in range(1, 21):
    dealer_id = i
    dealer_name = fake.company()
    dealer_data.append({'dealer_id': dealer_id, 'nama_dealer': dealer_name})

# Create a DataFrame from the dealer data
dealer = pd.DataFrame(dealer_data)
dealer

    dealer_id                     nama_dealer
0           1         Patel, Burke and Walker
1           2                        Buck Inc
2           3                 Salazar-Schmidt
3           4       Schroeder, Scott and Cobb
4           5    Anderson, Rojas and Alvarado
5           6         Rubio, Jackson and Cole
6           7                     Ponce-Patel
7           8                    Arellano PLC
8           9                       Green PLC
9          10     Mcintyre, Hoover and Flores
10         11         Stanley, Scott and Leon
11         12                        King LLC
12         13    Thompson, Morgan and Aguilar
13         14       Adams, Douglas and Curtis
14         15                      Chavez PLC
15         16        Harvey, Ryan and Bradley
16         17                     Vincent PLC
17         18                    Williams LLC
18         19                      Murray Ltd
19         20  Buchanan, Williams and Mendoza

In [20]:
n_city = len(city.kota_id.unique())
city_unique = city.kota_id.unique()

In [21]:
def generate_transaction_id(iteration):
    return f"{iteration+1}"

# Set the number of iterations
num_iterations = 2000


# Generate random car IDs and city IDs
car_ids = np.random.randint(1, 51, size=num_iterations)
dealer_ids = np.random.randint(1, 21, size=num_iterations)
city_ids = np.random.randint(0, n_city, size=num_iterations)
city_ids_transform = [city_unique[i] for i in city_ids]
# Create an empty DataFrame
transaction = pd.DataFrame({'transaksi_id':[i+1 for i in range(num_iterations)],'dealer_id': dealer_ids,'product_id': car_ids, 'kota_id': city_ids_transform})

transaction

      transaksi_id  dealer_id  product_id  kota_id
0                1         11          33     3173
1                2          3          26     3273
2                3         18          20     3175
3                4         16          12     3471
4                5          1          19     3172
...            ...        ...         ...      ...
1995          1996         17           9     6472
1996          1997          5          30     3578
1997          1998         16          28     1371
1998          1999          9          14     1371
1999          2000         16           3     3171

[2000 rows x 4 columns]

In [22]:
product.to_csv("data/product.csv",index=False)
city.to_csv("data/city.csv",index=False)
dealer.to_csv("data/dealer.csv",index=False)
transaction.to_csv("data/transaction.csv",index=False)